# 一行代码写for循环和if else语句############################################################################################
all_labels = [1, 0, 1]
all_predicts = [1, 0, 0]
temp = [1 if per_label == per_pred else 0 for per_label, per_pred in zip(all_labels, all_predicts)]
print(temp)
# #######################################################################################################################
c = {'脉搏': [100100, 100], '体温': '36.536.5', '呼吸': '242424', '血压高压': '115115', '血压低压': '7272',
     '一般情况': '营养发育正常，表情自然，神志清楚，反应好，面色红润，唇周无发绀，无脱水貌。  ',
     '皮肤粘膜': '皮肤无黄染，色泽正常，全身皮肤未见皮疹，未见皮下淤血。皮肤湿度、弹性均正常。全身皮肤未见水肿。无大理石花纹。', '浅表淋巴结': '全身浅表淋巴结未扪及肿大。',
     '颈部': '颈项无强直，颈动脉搏动正常，气管居中。', '胸部': '胸廓对称无畸形，肋间隙无增宽。',
     '肺部': ['双侧呼吸动度一致，双侧呼吸节律均匀、对称。', '双侧语颤/哭颤一致，无胸膜摩擦感，无皮下捻发感，胸骨无压痛。', '双肺叩诊清音。', '呼吸24次/分，双肺呼吸音粗，未闻及干湿性啰音，无胸膜摩擦音。'],
     '心脏': ['心前区无隆起。', '心尖搏动位置正常，未触及抬举样搏动，无震颤或心包摩擦感。', '心界不大，心脏相对浊音界正常。', '心率100次/分，心音有力，律齐，各瓣膜区未闻及杂音，无心包摩擦音。'],
     '血管': '无。',
     '腹部': ['外形平坦，未见胃肠型及蠕动波。腹壁静脉未见曲张，无手术瘢痕。', '全腹柔软，无压痛、反跳痛及肌紧张，肝、脾肋缘下未触及，未触及包块。', '呈鼓音，肝区无叩痛，双肾区无叩痛，移动性浊音阴性。',
            '肠鸣音正常，未闻及气过水声及血管杂音。'], '肛门直肠': '肛门无畸形。', '外生殖器': '外生殖器无畸形。'}
new_rec_data = {k: (''.join([str(p_str) for p_str in v]) if isinstance(v, list) else v) for k, v in c.items()}
